---
kind: type
id: T:Autodesk.Revit.DB.PointLocationOnCurve
source: html/f2e008f9-e1d1-a8ff-6a28-f15e180bf85f.htm
---
# Autodesk.Revit.DB.PointLocationOnCurve

Defines the measurement parameters necessary to create a point at a specific location on a curve.

## Syntax (C#)
```csharp
public class PointLocationOnCurve : IDisposable
```

## Remarks
The class will store the following and provides functions to deal with them:
 The user visible Measurement Type (driving parameter type). The corresponding measurement value (driving parameter). MeasureFrom that tells from where the (driving parameter) measurement is calculated.